tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "nextdns/tap"
tap "oven-sh/bun"
# Improved shell history for zsh and bash
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Mozilla CA certificate store
brew "ca-certificates"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Platform built on V8 to build network applications
brew "node"
# Package acting as bridge between Node projects and their package managers
brew "corepack"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS Client for Humans
brew "doggo"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Rainbows and unicorns in your console!
brew "lolcat"
# Move files and folders to the trash
brew "macos-trash"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Manage compile and link flags for libraries
brew "pkg-config"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Monitor data's progress through a pipe
brew "pv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# High-performance system programming language
brew "swift"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Execute commands when watched files change
brew "watchexec"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Launcher for *Epic Games* games
cask "epic-games"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-inter"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
# LibFUSE implementation that doesn't use kernel extensions
cask "fuse-t"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Grammarly for desktop
cask "grammarly-desktop"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Utility that shows the latest app updates
cask "latest"
# Customize mouse behavior
cask "linearmouse"
# Clipboard manager
cask "maccy"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Calculator and converter application
cask "numi"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Customize and maintain app icons
cask "pictogram"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Mesh VPN based on Wireguard
cask "tailscale"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
# OpenJDK distribution from Azul
cask "zulu8"
mas "Actions", id: 1586435171
mas "Amphetamine", id: 937984704
mas "Command X", id: 6448461551
mas "Craft", id: 1487937127
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Dropover", id: 1355679052
mas "Equinox", id: 1591510203
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "Keynote", id: 409183694
mas "MenubarX", id: 1575588022
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Shareful", id: 1522267256
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "TestFlight", id: 899247664
mas "Today", id: 6443714928
mas "Velja", id: 1607635845
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "ahmadalli.vscode-nginx-conf"
vscode "alyxz.icons-carbon-tweaked"
vscode "ambar.bundle-size"
vscode "arcanis.vscode-zipfs"
vscode "BeardedBear.beardedtheme"
vscode "bennycode.sort-everything"
vscode "bradlc.vscode-tailwindcss"
vscode "brunnerh.file-properties-viewer"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "denoland.vscode-deno"
vscode "devMike.mikrotik-routeros-script"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "Goopware.raythis"
vscode "heybourn.headwind"
vscode "IBM.output-colorizer"
vscode "idleberg.applescript"
vscode "ionutvmi.path-autocomplete"
vscode "jasonlhy.hungry-delete"
vscode "jock.svg"
vscode "letrieu.expand-region"
vscode "lkrms.inifmt"
vscode "maptz.camelcasenavigation"
vscode "matthewpi.caddyfile-support"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.symbols"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "nrwl.angular-console"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "Prisma.prisma"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sleistner.vscode-fileutils"
vscode "socheatsok78-lab.dotenv-vscode-stripped"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tommasov.hosts"
vscode "tonybaloney.vscode-pets"
vscode "undefined_publisher.yummey"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "withfig.fig"
vscode "yoavbls.pretty-ts-errors"
vscode "yusoofsh.moonic"
vscode "yy0931.gitconfig-lsp"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
