tap "ellie/atuin"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
tap "nextdns/tap"
tap "oven-sh/bun"
# Mozilla CA certificate store
brew "ca-certificates"
# Improved shell history for zsh and bash
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# GNU multiple precision arithmetic library
brew "gmp"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Platform built on V8 to build network applications
brew "node"
# Package acting as bridge between Node projects and their package managers
brew "corepack"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line DNS Client for Humans
brew "doggo"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Quickly rewrite git repository history
brew "git-filter-repo"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Rainbows and unicorns in your console!
brew "lolcat"
# Move files and folders to the trash
brew "macos-trash"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General-purpose scripting language
brew "php"
# Manage compile and link flags for libraries
brew "pkg-config"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Monitor data's progress through a pipe
brew "pv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Execute commands when watched files change
brew "watchexec"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Display management tool
cask "betterdisplay"
# Hardware benchmarking utility
cask "cinebench"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Developer platform
cask "dotnet-sdk"
# Launcher for *Epic Games* games
cask "epic-games"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-inconsolata"
cask "font-inter"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
cask "git-credential-manager-core"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Grammarly for desktop
cask "grammarly-desktop"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open-source video transcoder
cask "handbrake"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Utility that shows the latest app updates
cask "latest"
# Software for Logitech devices
cask "logi-options-plus"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# MikroTik Winbox
cask "nrlquaker-winbox"
# Calculator and converter application
cask "numi"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Customize and maintain app icons
cask "pictogram"
# Colour picker for colours onscreen
cask "pika"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Mesh VPN based on Wireguard
cask "tailscale"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
# OpenJDK distribution from Azul
cask "zulu8"
mas "Actions", id: 1586435171
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Command X", id: 6448461551
mas "Craft", id: 1487937127
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Dropover", id: 1355679052
mas "Enpass", id: 732710998
mas "Equinox", id: 1591510203
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "MenubarX", id: 1575588022
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Shareful", id: 1522267256
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "Today", id: 6443714928
mas "Velja", id: 1607635845
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
